In [1]:
# DATA
import pandas as pd

df = pd.DataFrame(
    data={
        'ID': [1, 2, 3, 4, 5, 6, 7, 8],
        'NAME': ['ADAM', 'PAUL', 'JACK', 'JOHN', 'ADAM', 'JENNIFER', 'WANDA', 'JOHNY'],
        'SURNAME': ['SMITH', 'WAGNER', 'RYAN', 'WICK', 'WAYNE', 'NICK', 'RYAN', 'BRYAN'],
        'COUNTRY': ['USA', 'FRANCE', 'GERMANY', 'CANADA', 'USA', 'CANADA', 'USA', 'FRANCE'],
        'AGE': [25, 35, 32, 40, 21, 24, 36, 19],
        'SALARY': [150000, 250000, 200000, 300000, 225000, 200000, 150000, 100000]
    }
)
df

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
0   1      ADAM   SMITH      USA   25  150000
1   2      PAUL  WAGNER   FRANCE   35  250000
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
4   5      ADAM   WAYNE      USA   21  225000
5   6  JENNIFER    NICK   CANADA   24  200000
6   7     WANDA    RYAN      USA   36  150000
7   8     JOHNY   BRYAN   FRANCE   19  100000

In [ ]:
# SINGLE CONDITION
# SELECT * FROM TABLE WHERE ID > 5

In [2]:
# method 1: Dataframe way
df[df['ID'] > 5]

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000
7   8     JOHNY   BRYAN  FRANCE   19  100000

In [3]:
# method 2: query function
df.query('ID > 5')

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000
7   8     JOHNY   BRYAN  FRANCE   19  100000

In [4]:
# method 3: loc function
df.loc[df["ID"] > 5]

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000
7   8     JOHNY   BRYAN  FRANCE   19  100000

In [ ]:
# SINGLE CONDITION (NOT)
# SELECT * FROM TABLE WHERE NOT ID > 5

In [5]:
# method 1: Dataframe way
df[~(df['ID'] > 5)]

   ID  NAME SURNAME  COUNTRY  AGE  SALARY
0   1  ADAM   SMITH      USA   25  150000
1   2  PAUL  WAGNER   FRANCE   35  250000
2   3  JACK    RYAN  GERMANY   32  200000
3   4  JOHN    WICK   CANADA   40  300000
4   5  ADAM   WAYNE      USA   21  225000

In [6]:
# method 2: query function
df.query('~(ID > 5)')

   ID  NAME SURNAME  COUNTRY  AGE  SALARY
0   1  ADAM   SMITH      USA   25  150000
1   2  PAUL  WAGNER   FRANCE   35  250000
2   3  JACK    RYAN  GERMANY   32  200000
3   4  JOHN    WICK   CANADA   40  300000
4   5  ADAM   WAYNE      USA   21  225000

In [ ]:
# MULTIPLE CONDITION (AND)
# SELECT * FROM TABLE WHERE ID > 5 AND COUNTRY = 'CANADA'

In [7]:
# method 1: Dataframe way
df[(df.ID > 5) & (df.COUNTRY == 'CANADA')]

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000

In [8]:
# method 2: query function
df.query('ID > 5 and COUNTRY == "CANADA"')

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000

In [ ]:
# MULTIPLE CONDITION (AND & OR)
# SELECT * FROM TABLE WHERE ID > 5 AND (COUNTRY = 'CANADA' OR COUNTRY = 'USA')

In [9]:
# method 1: Dataframe way
df[(df.ID > 5) & ((df.COUNTRY == 'CANADA') | (df.COUNTRY == 'USA'))]

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000

In [10]:
# method 2: query function
df.query('ID > 5 and (COUNTRY == "CANADA" or COUNTRY == "USA")')

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000

In [ ]:
# IN OPERATOR
# SELECT * FROM TABLE WHERE COUNTRY IN  ('GERMANY', 'FRANCE')

In [11]:
# method 1: Dataframe way
df[df.COUNTRY.isin(['GERMANY','FRANCE'])]

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
1   2   PAUL  WAGNER   FRANCE   35  250000
2   3   JACK    RYAN  GERMANY   32  200000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [12]:
# method 2: query function
df.query('COUNTRY in ["GERMANY","FRANCE"]')

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
1   2   PAUL  WAGNER   FRANCE   35  250000
2   3   JACK    RYAN  GERMANY   32  200000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [13]:
df.query('COUNTRY.isin(["GERMANY", "FRANCE"]).values')

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
1   2   PAUL  WAGNER   FRANCE   35  250000
2   3   JACK    RYAN  GERMANY   32  200000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [ ]:
# NOT IN OPERATOR
# SELECT * FROM TABLE WHERE COUNTRY NOT IN  ('USA', 'FRANCE')

In [14]:
# method 1: Dataframe way
df[~df.COUNTRY.isin(['USA','FRANCE'])]

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
5   6  JENNIFER    NICK   CANADA   24  200000

In [15]:
# method 2: query function
df.query('COUNTRY not in ["USA","FRANCE"]')

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
5   6  JENNIFER    NICK   CANADA   24  200000

In [16]:
df.query('~(COUNTRY in ["USA","FRANCE"])')

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
5   6  JENNIFER    NICK   CANADA   24  200000

In [ ]:
# LIKE OPERATOR - startswith
# SELECT * FROM TABLE WHERE SURNAME LIKE ''WA%"

In [17]:
# method 1: Dataframe way
df[df.SURNAME.str.startswith('WA')]

   ID  NAME SURNAME COUNTRY  AGE  SALARY
1   2  PAUL  WAGNER  FRANCE   35  250000
4   5  ADAM   WAYNE     USA   21  225000

In [18]:
# method 2: query function
df.query('SURNAME.str.startswith("WA")')

   ID  NAME SURNAME COUNTRY  AGE  SALARY
1   2  PAUL  WAGNER  FRANCE   35  250000
4   5  ADAM   WAYNE     USA   21  225000

In [ ]:
# LIKE OPERATOR - endswith
# SELECT * FROM TABLE WHERE SURNAME LIKE "%YAN"

In [19]:
# method 1: Dataframe way
df[df.SURNAME.str.endswith('YAN')]

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
2   3   JACK    RYAN  GERMANY   32  200000
6   7  WANDA    RYAN      USA   36  150000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [20]:
# method 2: query function
df.query('SURNAME.str.endswith("YAN").values')

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
2   3   JACK    RYAN  GERMANY   32  200000
6   7  WANDA    RYAN      USA   36  150000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [ ]:
# LIKE OPERATOR - contains
# SELECT * FROM TABLE WHERE NAME LIKE "%OH%"

In [21]:
# method 1: Dataframe way
df[df.NAME.str.contains('OH')]

   ID   NAME SURNAME COUNTRY  AGE  SALARY
3   4   JOHN    WICK  CANADA   40  300000
7   8  JOHNY   BRYAN  FRANCE   19  100000

In [22]:
# method 2: query function
df.query('NAME.str.contains("OH")')

   ID   NAME SURNAME COUNTRY  AGE  SALARY
3   4   JOHN    WICK  CANADA   40  300000
7   8  JOHNY   BRYAN  FRANCE   19  100000

In [ ]:
# IS NULL
# SELECT * FROM TABLE WHERE COUNTRY IS NULL

In [23]:
# Change USA to NaN
import numpy as np

df.loc[df.COUNTRY == "USA", 'COUNTRY'] = np.nan
df

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
0   1      ADAM   SMITH      NaN   25  150000
1   2      PAUL  WAGNER   FRANCE   35  250000
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
4   5      ADAM   WAYNE      NaN   21  225000
5   6  JENNIFER    NICK   CANADA   24  200000
6   7     WANDA    RYAN      NaN   36  150000
7   8     JOHNY   BRYAN   FRANCE   19  100000

In [24]:
# method 1: Dataframe way
df[df.COUNTRY.isnull()]
df[df.COUNTRY.isna()]

   ID   NAME SURNAME COUNTRY  AGE  SALARY
0   1   ADAM   SMITH     NaN   25  150000
4   5   ADAM   WAYNE     NaN   21  225000
6   7  WANDA    RYAN     NaN   36  150000

In [25]:
# method 2: query function
df.query('COUNTRY.isna()')
df.query('COUNTRY.isnull()')

   ID   NAME SURNAME COUNTRY  AGE  SALARY
0   1   ADAM   SMITH     NaN   25  150000
4   5   ADAM   WAYNE     NaN   21  225000
6   7  WANDA    RYAN     NaN   36  150000

In [ ]:
# IS NOT NULL
# SELECT * FROM TABLE WHERE COUNTRY IS NOT NULL

In [26]:
# method 1: Dataframe way
df[df.COUNTRY.notna()]
df[df.COUNTRY.notnull()]

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
1   2      PAUL  WAGNER   FRANCE   35  250000
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
5   6  JENNIFER    NICK   CANADA   24  200000
7   8     JOHNY   BRYAN   FRANCE   19  100000

In [27]:
# method 2: query function
df.query('COUNTRY.notna()')
df.query('COUNTRY.notnull()')

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
1   2      PAUL  WAGNER   FRANCE   35  250000
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
5   6  JENNIFER    NICK   CANADA   24  200000
7   8     JOHNY   BRYAN   FRANCE   19  100000

In [28]:
# FILTER DATES
df['MEMBER_DATE'] = [
    '2021-02-14','2005-03-17','2000-03-01','1999-01-19',
    '2011-04-24','2008-11-10','2015-11-30','2019-04-19'
]

df

   ID      NAME SURNAME  COUNTRY  AGE  SALARY MEMBER_DATE
0   1      ADAM   SMITH      NaN   25  150000  2021-02-14
1   2      PAUL  WAGNER   FRANCE   35  250000  2005-03-17
2   3      JACK    RYAN  GERMANY   32  200000  2000-03-01
3   4      JOHN    WICK   CANADA   40  300000  1999-01-19
4   5      ADAM   WAYNE      NaN   21  225000  2011-04-24
5   6  JENNIFER    NICK   CANADA   24  200000  2008-11-10
6   7     WANDA    RYAN      NaN   36  150000  2015-11-30
7   8     JOHNY   BRYAN   FRANCE   19  100000  2019-04-19

In [ ]:
# FILTER STRING DATES
# SELECT * FROM TABLE WHERE MEMBER_DATE > '2015-01-01'

In [29]:
# method 1: Dataframe way
df[df.MEMBER_DATE > '2015-01-01']

   ID   NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
0   1   ADAM   SMITH     NaN   25  150000  2021-02-14
6   7  WANDA    RYAN     NaN   36  150000  2015-11-30
7   8  JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [30]:
# FILTER STRING DATES
# method 2: query function
df.query("MEMBER_DATE > '2015-01-01'")

   ID   NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
0   1   ADAM   SMITH     NaN   25  150000  2021-02-14
6   7  WANDA    RYAN     NaN   36  150000  2015-11-30
7   8  JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [ ]:
# FILTER DATETIME DATES
# SELECT * FROM TABLE WHERE YEAR(MEMBER_DATE) > 2015

In [31]:
df.MEMBER_DATE = pd.to_datetime(df.MEMBER_DATE)

In [42]:
# method 1: Dataframe way
df[df.MEMBER_DATE.dt.year < 2005]

   ID  NAME SURNAME  COUNTRY  AGE  SALARY MEMBER_DATE
2   3  JACK    RYAN  GERMANY   32  200000  2000-03-01
3   4  JOHN    WICK   CANADA   40  300000  1999-01-19

In [69]:
# method 2: query function
df.query("MEMBER_DATE.dt.year < 2005")

   ID  NAME SURNAME  COUNTRY  AGE  SALARY MEMBER_DATE
2   3  JACK    RYAN  GERMANY   32  200000  2000-03-01
3   4  JOHN    WICK      NaN   40  300000  1999-01-19

In [38]:
from dateutil.relativedelta import *
import datetime

date = df.MEMBER_DATE[0]

print('Date', date)                                 # Date 2021-02-14 00:00:00
print('+1 Day', date + relativedelta(days=+1))      # +1 Day 2021-02-15 00:00:00
print('+1 Week', date + relativedelta(weeks=+1))    # +1 Week 2021-02-21 00:00:00
print('+1 Month', date + relativedelta(months=+1))  # +1 Month 2021-03-14 00:00:00
print('+1 Year', date + relativedelta(years=+1))    # +1 Year 2022-02-14 00:00:00
print('-1 Year', date + relativedelta(years=-1))    # -1 Year 2020-02-14 00:00:00

Date 2021-02-14 00:00:00
+1 Day 2021-02-15 00:00:00
+1 Week 2021-02-21 00:00:00
+1 Month 2021-03-14 00:00:00
+1 Year 2022-02-14 00:00:00
-1 Year 2020-02-14 00:00:00

In [ ]:
# BASIC OPERATIONS
# SELECT * FROM TABLE WHERE SALARY / 20 < 12000;

In [48]:
# method 1: Dataframe way
df[(df.SALARY / 20 > 12000)]

   ID  NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
1   2  PAUL  WAGNER  FRANCE   35  250000  2005-03-17
3   4  JOHN    WICK  CANADA   40  300000  1999-01-19

In [45]:
# method 2: query function
df.query("SALARY / 20 > 12000")

   ID  NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
1   2  PAUL  WAGNER  FRANCE   35  250000  2005-03-17
3   4  JOHN    WICK  CANADA   40  300000  1999-01-19

In [ ]:
# SELECT * FROM TABLE WHERE NAME > 'JO';

In [50]:
# method 1: Dataframe way
df[(df.NAME > 'JO')]

   ID   NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
1   2   PAUL  WAGNER  FRANCE   35  250000  2005-03-17
3   4   JOHN    WICK  CANADA   40  300000  1999-01-19
6   7  WANDA    RYAN     NaN   36  150000  2015-11-30
7   8  JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [76]:
# method 2: query function
df.query("NAME > 'JO'")

   ID   NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
1   2   PAUL  WAGNER  FRANCE   35  250000  2005-03-17
3   4   JOHN    WICK     NaN   40  300000  1999-01-19
6   7  WANDA    RYAN     USA   36  150000  2015-11-30
7   8  JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [ ]:
# SELECT * FROM TABLE WHERE SALARY  * 20 > @VALUE;
value = 500000

In [56]:
# method 1: Dataframe way
df[(df.SALARY * 2 > value)]

   ID  NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
3   4  JOHN    WICK  CANADA   40  300000  1999-01-19

In [55]:
# method 2: query function
df.query("SALARY * 2 > @value")

   ID  NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
3   4  JOHN    WICK  CANADA   40  300000  1999-01-19

In [ ]:
# SELECT * FROM TABLE WHERE CONCAT(NAME, ' ' ,SURNAME) = 'PAUL WAGNER'
df['FULL NAME'] = df['NAME'] + ' ' + df["SURNAME"]

In [59]:
# method 1: Dataframe way
df[(df['FULL NAME'] == 'PAUL WAGNER')]

   ID  NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE    FULL NAME
1   2  PAUL  WAGNER  FRANCE   35  250000  2005-03-17  PAUL WAGNER

In [60]:
# method 2: query function
df.query("`FULL NAME` == 'PAUL WAGNER'")

   ID  NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE    FULL NAME
1   2  PAUL  WAGNER  FRANCE   35  250000  2005-03-17  PAUL WAGNER